---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheetType.SheetMass
source: html/d300cae8-6398-d321-4fb9-dcac1973e038.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.SheetMass Property

The sheet mass.

## Syntax (C#)
```csharp
public double SheetMass { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for sheetMass is not a number
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for sheetMass must be non-negative.